In [31]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns 
import sklearn

In [32]:
df = pd.read_csv("./Salary_Data.csv")
df.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [33]:
df.shape

(30, 2)

In [34]:
df1 = pd.read_csv('./data.csv')
df1.head()

   Height  Weight
0    1.47   52.21
1    1.50   53.12
2    1.52   54.48
3    1.55   55.84
4    1.57   57.20

In [35]:
df1.shape

(15, 2)

In [36]:
print(df.index)

RangeIndex(start=0, stop=30, step=1)

In [37]:
a = np.arange(15,31)
a

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30])

In [38]:
df.drop([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],axis = 0,inplace=True)

In [39]:
df.shape

(15, 2)

In [40]:
df1.shape

(15, 2)

In [41]:
b = df1['Height']
b

0     1.47
1     1.50
2     1.52
3     1.55
4     1.57
5     1.60
6     1.63
7     1.65
8     1.68
9     1.70
10    1.73
11    1.75
12    1.78
13    1.80
14    1.83
Name: Height, dtype: float64

In [42]:
df = pd.concat([df,b],axis = 1)

In [43]:
df.head()

   YearsExperience   Salary  Height
0              1.1  39343.0    1.47
1              1.3  46205.0    1.50
2              1.5  37731.0    1.52
3              2.0  43525.0    1.55
4              2.2  39891.0    1.57

In [44]:
df.to_csv('case.csv',index=False)

In [45]:
df.head()

   YearsExperience   Salary  Height
0              1.1  39343.0    1.47
1              1.3  46205.0    1.50
2              1.5  37731.0    1.52
3              2.0  43525.0    1.55
4              2.2  39891.0    1.57

In [46]:
df.shape

(15, 3)

In [47]:
data = pd.read_csv("./Salary_Data.csv")
data.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [48]:
data.shape

(30, 2)

In [49]:
data.drop([15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29],axis = 0,inplace=True)

In [50]:
data.shape

(15, 2)

In [51]:
data.to_csv("case2.csv",index=False)